<div id ="title">
    <div class="user-blok">
        <!-- Если пользователь гость то ему доступна форма авторизации-->
        <div class="login-form">

        </div><!-- login-form (End) -->
        <!--
        Если пользователь аутентифицирован, то для него вместо формы панель
        с логином приветствием и служебными кнопками (статус и выход) 
        -->
        <div class="login-stat">

        </div><!-- login-stat -->
    </div>
    <div class="logo">
    </div><!-- logo (End) -->
</div><!-- title (End) -->



<div id ="content">
    <!--
    Если пользователь не гость, то ему доступен функционал создать новый пост
    -->
    <div class="create-new-post">
    </div><!-- create-new-post (End) -->
    <!------------------------------------------------------------------------>
    <!-------------- Тело отдельного поста и комментария к нему -------------->
    <!------------------------------------------------------------------------>
    <div class="post">
        <div class="author">
        </div>
        <div class="date">
        </div>

        <!--
        Служебная строка для администратора позволяющая создавать комментарий
        для поста. А также создавать и удалять пост.
        -->
        <div class="adminwork">
            <div class="create-comment">

            </div>
            <div class="edit-post">

            </div>
            <div class="delete-post">

            </div>
        </div><!-- admin-work (End) -->

        <!--
        Если пользователь является автором и пост еще не закоментирован
        то доступна служебная панель позволяющая редактировать или удалять пост
        -->
        <div class="user-work">
            <div class="edit-post">

            </div>
            <div class="delete-post">

            </div>
        </div><!-- user-work (End) -->

        <!----------------------- Само тело поста. -------------------------->
        <div class="post-content">

        </div><!-- post-content (End) -->

        <!----- Если имеется комментарий к посту вывожу блок комментария ----->
        <div class="comment">
            <div class="comment-work">
                <div class="edit-comment">
                    <p>Edit</p>
                </div>
                <div class="delete-comment">
                    <p>Delete</p>
                </div>
            </div><!-- comment-work (End) -->
            
            <!-- Само тело комментария -->        
            <div class="comment-content">

            </div>

        </div><!-- comment (End) -->
    </div>
    <!------------------------------------------------------------------------>
    <!--------------------------- Конец блока post --------------------------->
    <!------------------------------------------------------------------------>
</div>